; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph4 - mode
	image3 - mode
	image1 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star2 - direction
	Star1 - direction
	Star4 - direction
	GroundStation3 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph0)
	(supports instrument1 image3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
)
(:goal (and
	(pointing satellite1 Star10)
	(pointing satellite2 Star1)
	(have_image Star10 image3)
	(have_image Star11 infrared2)
	(have_image Phenomenon12 spectrograph4)
))

)

; plan
1. (turn_to satellite1 star1 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star1)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite1 phenomenon12 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon12)
   goals met: 0 of 5
5. (turn_to satellite0 star2 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
6. (take_image satellite1 phenomenon12 instrument1 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 1 of 5
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
8. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 5
9. (turn_to satellite0 star11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star11)
   goals met: 1 of 5
10. (take_image satellite0 star11 instrument0 infrared2)
   added: (have_image star11 infrared2)
   goals met: 2 of 5
11. (turn_to satellite1 star10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star10)
   goals met: 3 of 5
12. (take_image satellite1 star10 instrument1 image3)
   added: (have_image star10 image3)
   goals met: 4 of 5
13. (turn_to satellite2 star1 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star1)
   goals met: 5 of 5
